SearchRequest(DAC-CXB-Return-2A-2C).xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <LowFareSearchReq xmlns="http://www.travelport.com/schema/air_v48_0" TargetBranch="P7212436" PreferCompleteItinerary="true">
            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v48_0" OriginApplication="uAPI" />
            
            <!-- Outbound Leg (Dhaka to Toronto) -->
            <SearchAirLeg>
                <SearchOrigin>
                    <CityOrAirport xmlns="http://www.travelport.com/schema/common_v48_0" Code="DAC" PreferCity="true" />
                </SearchOrigin>
                <SearchDestination>
                    <CityOrAirport xmlns="http://www.travelport.com/schema/common_v48_0" Code="CXB" PreferCity="true" />
                </SearchDestination>
                <SearchDepTime PreferredTime="2024-12-18" />
            </SearchAirLeg>
            
            <!-- Return Leg (Toronto to Dhaka) -->
            <SearchAirLeg>
                <SearchOrigin>
                    <CityOrAirport xmlns="http://www.travelport.com/schema/common_v48_0" Code="CXB" PreferCity="true" />
                </SearchOrigin>
                <SearchDestination>
                    <CityOrAirport xmlns="http://www.travelport.com/schema/common_v48_0" Code="DAC" PreferCity="true" />
                </SearchDestination>
                <SearchDepTime PreferredTime="2024-12-25" />
            </SearchAirLeg>

            <!-- Modifiers to specify connecting flights and economy cabin -->
            <AirSearchModifiers>
                <PreferredProviders>
                    <Provider xmlns="http://www.travelport.com/schema/common_v48_0" Code="1G" />
                </PreferredProviders>
                <PermittedCabins>
                    <CabinClass Type="Economy" xmlns="http://www.travelport.com/schema/common_v48_0" />
                </PermittedCabins>
                <FlightType MaxConnections="1" />
            </AirSearchModifiers>

            <!-- Passengers -->
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v48_0" Code="ADT" />
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v48_0" Code="ADT" />
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v48_0" Code="CNN" Age="10" />
            <SearchPassenger xmlns="http://www.travelport.com/schema/common_v48_0" Code="CNN" Age="8" />

            <!-- Pricing modifiers -->
            <AirPricingModifiers CurrencyType="INR">
                <!-- <AccountCodes>
                    <AccountCode xmlns="http://www.travelport.com/schema/common_v48_0" Code="-" />
                </AccountCodes> -->
            </AirPricingModifiers>
        </LowFareSearchReq>
    </soapenv:Body>
</soapenv:Envelope>
